Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
  //HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS , (uint32_t)FRAME_BUFFER, Im_size);
/*
  printf("\nLow Res : ");
  printf("Bayer\n");
  for(uint16_t i = 0; i < 10; i++)
  {
      for(uint32_t j=0; j<15;j++) printf("%d ", _fb_base_hr[i][j]);
      printf("\n");
  }

  printf("\nRGB\n");
  for(i = 0; i < 10; i++)
  {
      for(j=0; j<5; j++)
      {
        printf("%d ", _fb_base_lcd[i][j].r);
        printf("%d ", _fb_base_lcd[i][j].g);
        printf("%d ", _fb_base_lcd[i][j].b);
        printf("   ");
      }
      printf("\n");
  }

  printf("\nHigh Res : ");
  printf("Bayer\n");
  for(uint16_t i = 950; i < 960; i++)
  {
      for(uint32_t j=1275; j<1280;j++) printf("%d ", _fb_base_hr[i][j]);
      printf("\n");
  }

  printf("\nRGB\n");
  for(i = 950; i < 960; i++)
  {
      for(j=1275; j<1280; j++)
      {
        printf("%d ", _fb_base_ppm[i][j].r);
        printf("%d ", _fb_base_ppm[i][j].g);
        printf("%d ", _fb_base_ppm[i][j].b);
        printf("   ");
      }
      printf("\n");
  }

 */
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */
//    MX_USB_HOST_Process();
      if(cam_state_change)
      {
        cam_state_change = false;
        cam_func[cam_state] (cam_param);
//          HAL_GPIO_TogglePin (ARDUINO_D2_GPIO_PortD8_GPIO_Port, ARDUINO_D8_Pin);
      }
      __WFI();
      HAL_GPIO_TogglePin (ARDUINO_D8_GPIO_Port, ARDUINO_D8_Pin);

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Configure LSE Drive Capability 
  */
  HAL_PWR_EnableBkUpAccess();
  /** Configure the main internal regulator output voltage 
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Activate the Over-Drive mode 
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC|RCC_PERIPHCLK_RTC
                              |RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART6
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C3
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_CLK48;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  PeriphClkInitStruct.PLLSAIDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_8;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  PeriphClkInitStruct.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInitStruct.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
  PeriphClkInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  PeriphClkInitStruct.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;
  PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_CLK48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_1);
}

/* USER CODE BEGIN 4 */
/*
void HAL_Delay (uint32_t Delay)
{
    static uint32_t cycle = 0;
    for(cycle = 0; cycle < Delay; cycle++)
    {
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
//        __NOP();
    }
}
*/


void HAL_GPIO_EXTI_Callback (uint16_t GPIO_Pin)
{
//    printf ("%s : 0x%x\n", __func__, GPIO_Pin);
    switch(GPIO_Pin)
    {
        case USER_BUTTON_Pin : 
            {
                cam_state = CAM_SHOT;
                cam_state_change = true;
                cam_param = 0;
//                cam_func[cam_state] (0);
            }
            break;
        case ARDUINO_A1_Pin : 
            {
                cam_state = CAM_FLASH;
                cam_state_change = true;
                cam_param = 0;
                printf("Done : %d %d\n", cam_state, cam_state_change);
//                cam_func[cam_state] (0);
            }
            break;
    }
}

void trig_init ()
{
    static GPIO_InitTypeDef GPIO_InitStruct = {0};

    __disable_irq() ;
    HAL_GPIO_DeInit(USER_BUTTON_GPIO_Port, USER_BUTTON_Pin);
    HAL_GPIO_DeInit(ARDUINO_A1_GPIO_Port, ARDUINO_A1_Pin);
    /*Configure GPIO pin : PtPin */
    GPIO_InitStruct.Pin = USER_BUTTON_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(USER_BUTTON_GPIO_Port, &GPIO_InitStruct);


