Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
    GPIO_InitStruct.Pin = ARDUINO_A1_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(ARDUINO_A1_GPIO_Port, &GPIO_InitStruct);
    __enable_irq() ;

//    CAMERA_Init(CAMERA_RAW);

}

void sd_init (void)
{
    uint32_t status;
  if(BSP_SD_IsDetected ())
  {
      printf("SD Card detected\n");
      status = SD_initialize (0);
      if(status  == RES_OK)
      {
          printf("SD Card ready\n");
          HAL_Delay (100);
          status = f_mount (&SDFatFS, (const TCHAR*)SDPath, 1);
          if(status == FR_OK)
          {
              printf("Mount successful\n");
    
          }
          else {printf("Mount Failed : %d\n", status);}
      }
      else {printf("SD Card not ready : %d\n", hsd1.State);}
  }
  else{printf("SD Card not present\n");}
}

void write_sd_card (uint32_t file_no)
{
  uint32_t status = 0;
//  if(BSP_SD_IsDetected ())
//  {
//      printf("SD Card detected\n");
//      status = SD_initialize (0);
//      if(status  == RES_OK)
//      {
//          printf("SD Card ready\n");
//          HAL_Delay (100);
//          status = f_mount (&SDFatFS, (const TCHAR*)SDPath, 1);
//          if(status == FR_OK)
//          {
//              printf("Mount successful\n");
//              printf("SD Type %d Speed %d clk_div %d\n", hsd1.SdCard.CardType, hsd1.SdCard.Class, hsd1.Init.ClockDiv);
//              status = f_open (&fp, "RGB_Array_1.ppm", FA_CREATE_ALWAYS | FA_WRITE);
//              if(status == FR_OK)
//              {
//                  uint32_t byteswritten;
//                  printf("File open\n");
////                  HAL_Delay (10);
////                  printf("Frame buff pointer : 0x%x\n", _fb_base_hr);
//                  status = f_write (&fp,(void *)ppm_header, sizeof(ppm_header), &byteswritten);
//                  HAL_Delay (10);
//                  status = f_write (&fp,(void *)_fb_base_ppm, sizeof(_fb_base_ppm), &byteswritten);
//                  if(status == FR_OK)
//                  {
//                      printf("File write done\n");
//                      status = f_close (&fp);
//                      if(status == FR_OK)
//                      {
//                          printf("Safe to remove SD Card\n");
//                      }
//                      else{printf("Failed while appending : %d\n", status);}
//                  }
//                  else{printf("File write failed : %d\n", status);}
//              }
//              else {printf("File open failed : %d\n",status);}
//              status = f_open (&fp, "Low_Res1.ppm", FA_CREATE_ALWAYS | FA_WRITE);
//              if(status == FR_OK)
//              {
//                  uint8_t byteswritten;
//                  printf("File open\n");
////                  HAL_Delay (10);
////                  printf("Frame buff pointer : 0x%x\n", _fb_base_hr);
////                  status = f_write (&fp,(void *)ppm_header, sizeof(ppm_header), &byteswritten);
////                  HAL_Delay (10);
//                  status = f_write (&fp,(void *)_fb_base_lcd, sizeof(_fb_base_lcd), &byteswritten);
//                  if(status == FR_OK)
//                  {
//                      printf("File write done\n");
//                      status = f_close (&fp);
//                      if(status == FR_OK)
//                      {
//                          printf("Safe to remove SD Card\n");
//                      }
//                      else{printf("Failed while appending : %d\n", status);}
//                  }
//                  else{printf("File write failed : %d\n", status);}
//              }
//              else {printf("File open failed : %d\n",status);}
//              status = f_open (&fp, "Low_Res2.ppm", FA_CREATE_ALWAYS | FA_WRITE);
//              if(status == FR_OK)
//              {
//                  uint8_t byteswritten;
//                  printf("File open\n");
////                  HAL_Delay (10);
////                  printf("Frame buff pointer : 0x%x\n", _fb_base_hr);
////                  status = f_write (&fp,(void *)ppm_header, sizeof(ppm_header), &byteswritten);
////                  HAL_Delay (10);
//                  status = f_write (&fp,(void *)_fb_base_rgb, sizeof(_fb_base_rgb), &byteswritten);
//                  if(status == FR_OK)
//                  {
//                      printf("File write done\n");
//                      status = f_close (&fp);
//                      if(status == FR_OK)
//                      {
//                          printf("Safe to remove SD Card\n");
//                      }
//                      else{printf("Failed while appending : %d\n", status);}
//                  }
//                  else{printf("File write failed : %d\n", status);}
//              }
//              else {printf("File open failed : %d\n",status);}
              status = f_open (&fp, "RGB_Array_1.rgb", FA_CREATE_ALWAYS | FA_WRITE);
              if(status == FR_OK)
              {
                  uint8_t byteswritten;
                  printf("File open\n");
//                  HAL_Delay (10);
//                  printf("Frame buff pointer : 0x%x\n", _fb_base_hr);
//                  status = f_write (&fp,ppm_header, sizeof(ppm_header), &byteswritten);
//                  HAL_Delay (10);
                  status = f_write (&fp,(void *)_fb_base_hr, sizeof(_fb_base_hr), &byteswritten);
                  if(status == FR_OK)
                  {
//                      printf("File write done\n");
                      status = f_close (&fp);
                      if(status == FR_OK)
                      {
                          printf("Safe to remove SD Card\n");
                      }
                      else{printf("Failed while appending : %d\n", status);}
                  }
                  else{printf("File write failed : %d\n", status);}
              }
              else {printf("File open failed : %d\n",status);}
//          }
//          else {printf("Mount Failed : %d\n", status);}
//      }
//      else {printf("SD Card not ready : %d\n", hsd1.State);}
//  }
//  else{printf("SD Card not present\n");}
  printf("DCMI : state %d, Error %d\n",hdcmi.State, hdcmi.ErrorCode);
  printf("DMA : state %d, Error %d\n",hdcmi.DMA_Handle->State, hdcmi.DMA_Handle->ErrorCode);

