Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
}

uint8_t img_compress_rgb (void)
{
    static uint32_t cmpr_index;
    for(uint32_t index = 0; index < PIX_H; index += 4)
    {
        cmpr_index = (PIX_H/4) - index/4;
        for(uint32_t hr_i = 0, lr_i = PIX_W/4; hr_i < PIX_W; hr_i += 4, lr_i --)
        {
            _fb_base_rgb[cmpr_index][lr_i].r = _fb_base_hr[index][hr_i + 1];
            _fb_base_rgb[cmpr_index][lr_i].g = (_fb_base_hr[index][hr_i]
                + _fb_base_hr[index + 1][hr_i + 1])/2;
            _fb_base_rgb[cmpr_index][lr_i].b = _fb_base_hr[index+1][hr_i];
        }
    }
    return 0;
}

uint8_t img_compress_16 (uint32_t index)
{
    static uint32_t cmpr_index;
    cmpr_index = index/4;
    for(uint32_t hr_i = 0, lr_i = 0; hr_i < PIX_W; hr_i += 8, lr_i += 2)
    {
        _fb_base_lr[cmpr_index][lr_i] = _fb_base_hr[index][hr_i];
        _fb_base_lr[cmpr_index][lr_i+1] = _fb_base_hr[index][hr_i+1];
        _fb_base_lr[cmpr_index+1][lr_i] = _fb_base_hr[index+1][hr_i];
        _fb_base_lr[cmpr_index+1][lr_i+1] = _fb_base_hr[index+1][hr_i+1];
    }
}



uint8_t img_bayer2rgb (uint32_t index)
{
    //set last byte to '\n'
    //GBRG bayer format
    //if index = 0 || 479 (first and last row)
    if (index == 0 || index == (PIX_H-1))
    {
        //whole row zero
        memset (&_fb_base_ppm[index][0], 0, PIX_W*3);
    }
    //check if index is odd : BG
    else if (index % 2 != 0)
    {
        //run for start from blue
        for(uint32_t raw_i = 0; raw_i < PIX_W; raw_i++)
        {
            //0th byte || (PIX_W - 1) byte 
            if (raw_i == 0 || raw_i == (PIX_W - 1))
            {
                //all zero
                _fb_base_ppm[index][raw_i].r = 0;
                _fb_base_ppm[index][raw_i].g = 0;
                _fb_base_ppm[index][raw_i].b = 0;
            }
            //check if odd byte : Gb
            else if (raw_i % 2 != 0)
            {
                //red = vertical avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index - 1][raw_i] +
                    _fb_base_hr[index + 1][raw_i])/2;
                //green = reading
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i]
                    + _fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/5;
                //blue = horizontal avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index][raw_i - 1] 
                    + _fb_base_hr[index][raw_i + 1])/2;
            }
            //if even : B
            else
            {
                //red = diagonal avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/4;
                //green = vertical and horizontal avg
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i - 1]
                    + _fb_base_hr[index][raw_i + 1]
                    + _fb_base_hr[index - 1][raw_i]
                    + _fb_base_hr[index + 1][raw_i])/4;
                //blue = reading
                _fb_base_ppm[index][raw_i].b = _fb_base_hr[index][raw_i];
            }
        }
    
    }
    //else index is even : GR
    else
    {
        //run for start from green
        for(uint32_t raw_i = 0; raw_i < PIX_W; raw_i++)
        {
            //0th byte || (PIX_W - 1)th byte:
            if (raw_i == 0 || raw_i == (PIX_W - 1))
            {
                //all zeros
                _fb_base_ppm[index][raw_i].r = 0;
                _fb_base_ppm[index][raw_i].g = 0;
                _fb_base_ppm[index][raw_i].b = 0;
            }
            //check if odd byte : R
            else if(raw_i%2 != 0)
            {
                //red = reading
                _fb_base_ppm[index][raw_i].r = _fb_base_hr[index][raw_i];
                //green = horizontal and vertical avg
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i - 1]
                    + _fb_base_hr[index][raw_i + 1]
                    + _fb_base_hr[index - 1][raw_i]
                    + _fb_base_hr[index + 1][raw_i])/4;
                //blue = diagonal avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/4;
            }
            //if even : Gr
            else
            {
                //red = horizontal avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index][raw_i - 1] 
                    + _fb_base_hr[index][raw_i + 1])/2;
                //green = reading + diagonal corner
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i] 
                    + _fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/5;
                //blue = vertical avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index - 1][raw_i] 
                    + _fb_base_hr[index + 1][raw_i])/2;
            }
        }
    }
    
    
    //append file
//    uint8_t status;
//     status = img_file_append (_fb_base_ppm, sizeof(_fb_base_ppm));
//     printf("%d : %d\n", index, status);
//     return status;
    return 0;
            
}

//Split function into 4 functions
//0. Zeros
//1. Odd rows odd columns
//2. Even rows odd columns
//3. Odd rows even columns
//4. Even rows even columns
uint8_t lcd_bayer2rgb (uint32_t index)
{
    //set last byte to '\n'
    //GBRG bayer format
    //if index = 0 || 479 (first and last row)
    if (index == 0 || index == (239))
    {
        //whole row zero
        memset (&_fb_base_lcd[index][0], 0, 320*3);
    }
    //check if index is odd : BG
    else if (index % 2 != 0)
    {
        //run for start from blue
        for(uint32_t raw_i = 0; raw_i < 320; raw_i++)
        {
            //0th byte || (PIX_W - 1) byte 
            if (raw_i == 0 || raw_i == (320 - 1))
            {
                //all zero
                _fb_base_lcd[index][raw_i].r = 0;
                _fb_base_lcd[index][raw_i].g = 0;
                _fb_base_lcd[index][raw_i].b = 0;
            }
            //check if odd byte : Gb
            else if (raw_i % 2 != 0)
            {
                //red = vertical avg
                _fb_base_lcd[index][raw_i].r = (_fb_base_lr[index - 1][raw_i] +
                    _fb_base_lr[index + 1][raw_i])/2;
                //green = reading
                _fb_base_lcd[index][raw_i].g = (_fb_base_lr[index][raw_i]
                    + _fb_base_lr[index - 1][raw_i - 1] 
                    + _fb_base_lr[index - 1][raw_i + 1]
                    + _fb_base_lr[index + 1][raw_i - 1]
                    + _fb_base_lr[index + 1][raw_i + 1])/5;
                //blue = horizontal avg
                _fb_base_lcd[index][raw_i].b = (_fb_base_lr[index][raw_i - 1] 
                    + _fb_base_lr[index][raw_i + 1])/2;
            }
            //if even : B
            else
            {
                //red = diagonal avg
                _fb_base_lcd[index][raw_i].r = (_fb_base_lr[index - 1][raw_i - 1] 
                    + _fb_base_lr[index - 1][raw_i + 1]
                    + _fb_base_lr[index + 1][raw_i - 1]
                    + _fb_base_lr[index + 1][raw_i + 1])/4;
                //green = vertical and horizontal avg
                _fb_base_lcd[index][raw_i].g = (_fb_base_lr[index][raw_i - 1]
                    + _fb_base_lr[index][raw_i + 1]
                    + _fb_base_lr[index - 1][raw_i]
                    + _fb_base_lr[index + 1][raw_i])/4;
                //blue = reading
                _fb_base_lcd[index][raw_i].b = _fb_base_lr[index][raw_i];
            }
        }
    
